artillery/about-artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 20
      name: "warm up"
  payload:
    path: "artillery-reviews.csv"
    fields: 
      - "id"
      - "userId"
      - "listId"
      - "rating"
    order: "sequence"
scenarios:
  - name: "get hosts by userId"
    weight: 25
    flow:
    - loop:
      - get:
          url: "/api/about/hosts/{{ userId }}"
      count: 20
  - name: "get reviews by userId"
    weight: 20
    flow: 
    - loop: 
      - get:
          url: "/api/about/reviews/{{ userId }}"
      count: 20
  - name: "get listings by listId"
    weight: 30
    flow:
    - loop:
      - get:
          url: "/api/about/neighborhood/{{ listId }}"
      count: 20  
  - name: "post review for host"
    weight: 20
    flow:
    - loop:
      - post:
          url: "/api/about/reviews/new"
          json: 
            id: "{{ id }}"
            userId: "{{ userId }}"
            listId: "{{ listId }}"
            rating: "{{ rating }}"
      count: 20
  # - name: "delete review"
  #   weight: 5 
  #   flow:
  #   - loop:
  #     - delete:
  #         url: "/api/about/reviews/{{ id }}/delete"           
  #     count: 10
  # - name: "update review rating"
  #   weight: 5
  #   flow: 
  #   - loop:
  #     - put: 
  #         url: "/api/about/reviews/{{ id }}/update"
  #         json:
  #           rating: {{ rating }}
  #     count: 10